; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	infrared3 - mode
	thermograph0 - mode
	image2 - mode
	spectrograph4 - mode
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star9 - direction
	Star12 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	Star14 - direction
	Star11 - direction
	GroundStation7 - direction
	Star4 - direction
	GroundStation6 - direction
	Star8 - direction
	Star1 - direction
	GroundStation13 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star14)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star9)
	(supports instrument3 spectrograph4)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument4 image1)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 thermograph0)
	(supports instrument5 image2)
	(calibration_target instrument5 Star14)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument6 spectrograph4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star14)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
	(supports instrument7 thermograph0)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation13)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 Star4)
	(supports instrument8 spectrograph4)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation13)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon16)
)
(:goal (and
	(pointing satellite0 Phenomenon16)
	(pointing satellite1 GroundStation6)
	(pointing satellite3 GroundStation13)
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation13 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 groundstation13)
   goals met: 1 of 8
2. (turn_to satellite2 groundstation6 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation6)
   goals met: 1 of 8
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
4. (calibrate satellite2 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 1 of 8
5. (turn_to satellite2 planet17 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 planet17)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation6 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 8
7. (turn_to satellite0 star14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star14)
   goals met: 2 of 8
8. (take_image satellite2 planet17 instrument4 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 3 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
10. (calibrate satellite0 instrument0 star14)
   added: (calibrated instrument0)
   goals met: 3 of 8
11. (turn_to satellite0 star18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star18)
   goals met: 3 of 8
12. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 4 of 8
13. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 4 of 8
14. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 5 of 8
15. (turn_to satellite0 phenomenon16 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 8
16. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 7 of 8
17. (turn_to satellite2 star15 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 star15)
   goals met: 7 of 8
18. (take_image satellite2 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 8 of 8
